Revit 2027 API
ColorWithTransparency.SetRed Method
 set red
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRed(
	uint red
)
Public Sub SetRed (
	red As UInteger
)
public:
void SetRed(
	unsigned int red
)
member SetRed :
        red : uint32 -> unit
Parameters
red UInt32
 red
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The value is not valid. The valid range is 0 to 255.
See Also
Reference
ColorWithTransparency Class
Autodesk.Revit.DB Namespace